---
kind: property
id: P:Autodesk.Revit.DB.IConnector.Width
zh: 宽度
source: html/92181844-bac8-96ab-eeac-bf4e62339f82.htm
---
# Autodesk.Revit.DB.IConnector.Width Property

**中文**: 宽度

The width of the connector.

## Syntax (C#)
```csharp
double Width { get; }
```

## Remarks
This property is used to retrieve the width of the connector.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when the connector's shape is not rectangular.